const convertNumToWords = (num) => {
   // I finished my homework
   // Transmit numbers into a string in words (russian only)

   // EXMAPLE:
   // console.log(convertNumToWords(590177252000)); => "пятьсот девяносто миллиардов сто семьдесят семь миллионов двести пятьдесят две тысячи"
   // console.log(convertNumToWords("590177252000")); => "пятьсот девяносто миллиардов сто семьдесят семь миллионов двести пятьдесят две тысячи"

   const title = [
      // 0 - без разряда
      ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""],
      // 1 - (тысяча / тысячи / тысяч)
      ["тысяч", "тысяча", "тысячи", "тысячи", "тысячи", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч", "тысяч"],
      // 2 - (миллион / миллиона / миллионов)
      ["миллионов", "миллион", "миллиона", "миллиона", "миллиона", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов", "миллионов"],
      // 3 - (миллиард / миллиарда / миллиардов)
      ["миллиардов", "миллиард", "миллиарда", "миллиарда", "миллиарда", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов", "миллиардов"],
      // 4 - (триллион / триллиона / триллионов)
      ["триллионов", "триллион", "триллиона", "триллиона", "триллиона", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов", "триллионов"],
      // 5 - (квадриллион / квадриллиона / квадриллионов)
      ["квадриллионов", "квадриллион", "квадриллиона", "квадриллиона", "квадриллиона", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов", "квадриллионов"],
      // 6 - (квинтиллион / квинтиллиона / квинтиллионов)
      ["квинтиллионов", "квинтиллион", "квинтиллиона", "квинтиллиона", "квинтиллиона", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов", "квинтиллионов"],
      // 7 - (секстиллион / секстиллиона / секстиллионов)
      ["секстиллионов", "секстиллион", "секстиллиона", "секстиллиона", "секстиллиона", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов", "секстиллионов"],
      // 8  - от 0 до 999
      ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одинадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"],
      // 9 - десятки
      ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"],
      // 10 - сотни
      ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"],
   ]
   let arrTemp = [];
   let arrStr = [];
   let result = "";

   // проверка на ошибки и лимиты
   if (+num / 1 != +num) { return "ошибка в строке, не получается привести к числу" }
   if (num === 0 || num.toString() === "0") { return "ноль" }
   if (num === undefined || num === "") { return "пустая строка" }
   if (num > 999999999999999999999999 || num.toString().length > 24) { return "Слишком большое число, максимум 24 разряда (999 секстиллионов)" }


   const convertNumToArray = (num) => {
      let str = num.toString().split("").reverse().join("");
      const pattern = new RegExp(".{1,3}", "g");
      let result = str.match(pattern);
      result.reverse();
      for (let i = 0; i < result.length; i++) {
         result[i] = result[i].split("").reverse().join("");
      }
      while (result[0].length < 3) {
         result[0] = "0" + result[0];
      }
      return result;
   }


   arrTemp = convertNumToArray(num);
   arrTemp.reverse();
   arrTemp.forEach((element, index) => {
      let str_1 = "";
      let str_10 = "";
      let str_100 = "";
      let tail = "";

      // формируем единицы, если предыдущее число = "1" - берем сразу два числа и формируем строку от 10 до 19
      if (element[1] === "1") {
         let i = element[1] + element[2]
         str_1 = title[8][i];
      } else { // для 1 и 2 тысяч требуется другое склонение числа, чтобы не получилось "один тысяча, два тысяч"
         if (index === 1 && element[2] === "1" && element[1] != "1") {
            str_1 = "одна";
         } else if (index === 1 && element[2] === "2" && element[1] != "1") {
            str_1 = "две";
         }
         else {
            str_1 = title[8][element[2]];
         }
         str_10 = title[9][element[1]];
      }

      // формируем сотни
      str_100 = title[10][element[0]];

      // добавляем строку "тысяч"..."миллионов"... и т.д.
      // если второе число равно единице то берем в индекс сразу два значения
      element
      if (index > 0 && element[1] === "1") {
         let i = element[1] + element[2]
         tail = title[index][i];
      } else {
         tail = title[index][element[element.length - 1]];
      }

      result = `${str_100}`; // сотни
      str_10
      result = `${result} ${str_10}`; // десятки
      result = result.trim();
      result = `${result} ${str_1}`; // единицы
      result = result.trim();
      result = `${result} ${tail}`; // разрядность
      result = result.trim();
      arrStr.push(result);
      result = "";
   });
   arrStr.reverse();
   result = arrStr.join(" ");
   result = result.trim();
   return result
}

console.log(convertNumToWords(590177252000));